In [8]:
import pandas as pd

data = {
    'Name': ['Alice', 'Bob', 'Charlie', 'David', 'Eva'],
    'Age': [23, 35, 45, 36, 28],
    'City': ['New York', 'Los Angeles', 'Chicago', 'Houston', 'Phoenix']
}

df = pd.DataFrame(data)
print(df)

      Name  Age         City
0    Alice   23     New York
1      Bob   35  Los Angeles
2  Charlie   45      Chicago
3    David   36      Houston
4      Eva   28      Phoenix

In [9]:
df.iloc[2]

Name    Charlie
Age          45
City    Chicago
Name: 2, dtype: object

In [17]:
df.iloc[:, 1]

0    23
1    35
2    45
3    36
4    28
Name: Age, dtype: int64

In [20]:
df.iloc[:3]

      Name  Age         City
0    Alice   23     New York
1      Bob   35  Los Angeles
2  Charlie   45      Chicago

In [21]:
df.iloc[:3][['Name', 'City']]

      Name         City
0    Alice     New York
1      Bob  Los Angeles
2  Charlie      Chicago

In [22]:
df.loc[df['Name'] == 'Charlie']

      Name  Age     City
2  Charlie   45  Chicago

In [23]:
df.loc[:, 'Age']

0    23
1    35
2    45
3    36
4    28
Name: Age, dtype: int64

In [24]:
df.loc[df['Name'].isin(['Bob', 'Eva']), 'City']

1    Los Angeles
4        Phoenix
Name: City, dtype: object

In [ ]:
#Exercise 2

In [25]:
task_1 = df.loc[df['Age'] > 30]
task_1

      Name  Age         City
1      Bob   35  Los Angeles
2  Charlie   45      Chicago
3    David   36      Houston

In [26]:
task_2 = df.loc[df['City'].isin(['Chicago', 'Houston'])]
task_2

      Name  Age     City
2  Charlie   45  Chicago
3    David   36  Houston

In [27]:
df.set_index('Name', inplace=True)
task_3 = df.loc['David']
task_3

Age          36
City    Houston
Name: David, dtype: object

In [28]:
task_4 = df.loc[['Bob', 'Eva'], ['Age', 'City']]
task_4

      Age         City
Name
Bob    35  Los Angeles
Eva    28      Phoenix

In [ ]:
#Exercise 3

In [32]:
data = {
'Product': ['Apple', 'Banana', 'Carrot', 'Doughnut', 'Egg'], 'Price': [0.5, 0.3, 0.4, 1.0, 0.2],
'In Stock': [True, True, False, True, False]
}
df = pd.DataFrame(data) 
print(df)

    Product  Price  In Stock
0     Apple    0.5      True
1    Banana    0.3      True
2    Carrot    0.4     False
3  Doughnut    1.0      True
4       Egg    0.2     False

In [33]:
task_1 = df.loc[df['In Stock']]
task_1

    Product  Price  In Stock
0     Apple    0.5      True
1    Banana    0.3      True
3  Doughnut    1.0      True

In [36]:
df.loc[df['Product'] == 'Doughnut', 'Price'] = 1.2
df[df['Product'] == 'Doughnut']

    Product  Price  In Stock
3  Doughnut    1.2      True

In [35]:
task_3 = df.loc[df['Price'] < 0.5]
task_3

  Product  Price  In Stock
1  Banana    0.3      True
2  Carrot    0.4     False
4     Egg    0.2     False

In [37]:
task_4 = df.loc[~df['In Stock'], ['Product', 'Price']]
task_4

  Product  Price
2  Carrot    0.4
4     Egg    0.2